{
  "source": {
    "categories": [
      {
        "name": "The Buddha's Teachings",
        "enDesc": "",
        "enShortDesc": "Kangyur and newly translated teachings of the Buddha"
      },
      {
        "name": "Prajnaparamita 1",
        "enDesc": "",
        "enShortDesc": ""
      },
      {
        "name": "Combined Commentary March 2025",
        "enDesc": "",
        "enShortDesc": ""
      }
    ],
    "books": [
      {
        "title": "Combined Commentary March 2025[zh]",
        "language": "zh",
        "versionSource": "claude",
        "direction": "ltr",
        "completestatus": "done",
        "content": []
      }
    ]
  },
  "target": {
    "categories": [
      {
        "name": "སངས་རྒྱས་ཀྱི་བཀའ།",
        "heDesc": "",
        "heShortDesc": "བཀའ་འགྱུར་དང་དེང་དུས་གསར་དུ་བསྒྱུར་བའི་བཀའ།"
      },
      {
        "name": "ཤེར་ཕྱིན།",
        "heDesc": "",
        "heShortDesc": ""
      },
      {
        "name": "རྡོ་རྗེ་གཅོད་པའི་རྒྱ་ཡིག་འགྲེལ་པ་ཕྱོགས་བསྡུས།",
        "heDesc": "",
        "heShortDesc": ""
      }
    ],
    "books": [
      {
        "title": "232332",
        "language": "bo-w",
        "versionSource": "claude",
        "direction": "lr",
        "completestatus": "done",
        "content": [
          [
            "བཅོམ་ལྡན་འདས་མ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་མ་ལ་ཕྱག་འཚལ་ལོ།། ​གཞི་དྲན་པ་མེད་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་དང་། ལམ་སྐྱེ་བ་མེད་པ་ལམ་གྱི་རྣམ་པར་ཤེས་པ་ཉིད་དང་། འབྲས་བུ་བློ་ལས་འདས་པ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་ཕྱག་འཚལ་ལོ།། ​གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཕྱག་འཚལ་བ་དེ་ནི་ཀུན་མཁྱེན་ཡེ་ཤེས་ལ་ཕྱག་འཚལ་བ་ཡིན་ནོ།། ​",
            "​དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཟབ་མོ་སྣང་བ་ཞེས་བྱ་བ་ནི་ཟབ་པ་ནི་དྲན་པ་དང་རིག་པ་དང་བློའི་རྣམ་པ་གང་གིས་ཀྱང་མ་གོས་པ། དཔེ་དང་བརྡས་མཚོན་དུ་མེད་པ་ཡིན་ཡང་ནམ་མཁའ་ལྟར་མཐའ་དབུས་མེད་པའི་ཆོས་ཉིད་དོ།། ​སྣང་བ་ནི་དྲན་པ་བློ་བུར་ནམ་མཁའ་ལ་ནམ་གཞུག་ཆད་ཀའི་སྦྲང་བུ་རྒྱུ་བ་ལྟར་མི་རྟག་པ་དང་འགྱུར་བ་ཅན་ཡང་དག་པ་མ་ཡིན་པ་ཐུགས་ལ་དགོངས་པའི་ཕྱིར་རོ།། ཆོས་ཀྱི་རྣམ་གྲངས་ནི་ཟབ་པ་དང་རྒྱ་ཆེ་བའོ།། ​ཟབ་པ་དང་རྒྱ་ཆེ་བ་ནི་གཅིག་ལ་མ་འདྲེས་པ་དཔེར་ན་མཚོ་དང་བ་ལ་ནམ་མཁའི་གཟུགས་བརྙན་མཐོང་བ་ནི་དཀོན་ནོ།། ​ཉི་མ་དང་ཟླ་བ་དང་སྐར་མ་ལ་སོགས་པའི་གཟུགས་བརྙན་མཐོང་བ་ནི་ཤིན་ཏུ་མང་ངོ་།། ​དེ་བཞིན་དུ་ཟབ་པའི་ཆོས་དྲན་པ་མེད་པ་དང་། སྐྱེ་བ་མེད་པ་དང་། བློའི་སྤྱོད་ཡུལ་མ་ཡིན་པ་ལ་འདྲིས་ཤིང་ཡིད་ཆེས་པའི་སྐྱེས་བུ་ནི་ཤིན་ཏུ་དཀོན་ནོ།། རྒྱ་ཆེ་བའི་ཆོས་དྲན་པའི་རྣམ་གྲངས་མི་འདྲ་བ་ལ་ཆགས་ཤིང་ཡིད་ཆེས་པ་ནི་ཤིན་ཏུ་མང་ངོ་།། ​ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ་ནི་ཟབ་པ་དང་རྒྱ་ཆེ་བ་ཆོས་ཀྱི་དབྱིངས་སུ་ཐ་མི་དད་པ་སྟེ། དཔེར་ན་མཚོ་དང་བ་ལ་ནམ་མཁའི་གཟུགས་བརྙན་ཤར་བ་ན་ཉི་མ་དང་ཟླ་བ་དང་སྐར་མ་ལ་སོགས་པའི་གཟུགས་བརྙན་ཤར་བ་ནི་ཆུ་བོའི་ངོ་བོར་གཅིག་པ་བཞིན་དུ། དུས་གསུམ་དུ་རྣམ་པར་བཞུགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་ཐུགས་ཀྱི་དགོངས་པ་གཅིག་པ་ཡིན་ནོ།། ​",
            "ཡང་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ནི་སངས་རྒྱས་ཉིད་ཀྱིས་དགོངས་པའི་ཟབ་མོའི་ཆོས་ཉིད་ལ་དགོངས་ནས་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་ཐབས་ཀྱི་སྣང་བ་ལ་གནས་པས་སོ།། ​སེམས་དཔའ་ཆེན་པོ་ནི་དུས་གསུམ་གྱི་སངས་རྒྱས་ཀྱི་དགོངས་པ་ལ་གནས་ནས་སེམས་ཅན་གྱི་ཁམས་དཔག་ཏུ་མེད་པའི་དོན་མཛད་པས་སོ།། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ནི་འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པ་ལས་འཕགས་ནས་རྣམ་པར་མི་རྟོག་པའི་ཡེ་ཤེས་ཀྱི་སྤྱན་གྱིས་གཟིགས་ཤིང་དམིགས་པ་མེད་པའི་ཐུགས་རྗེ་མངའ་བས་སོ།། ​ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཤེས་རབ་ཕྱིན་ཅི་མ་ལོག་པའི་ཤེས་པའོ།། ​ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་བློའི་སྤྱོད་ཡུལ་ལས་འདས་པའོ།། ​ཟབ་མོ་སྤྱོད་པ་ཉིད་ལ་ལྟ་ཞིང་ནི་དྲན་པའི་རྣམ་པས་མ་གོས་པ་ལས་སྣ་ཚོགས་ཤར་བས་སྤྱོད་པ་མ་ངེས་པ་ལ་ལྟོས་པས་སོ།། ",
            "​ཕུང་པོ་ལྔ་པོ་དེ་དག་ལ་ཡང་ནི་གཟུགས་ཀྱི་ཕུང་པོ་ལ་སོགས་པའི་ཟག་པ་དང་བཅས་པ་དེ་དག་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ལ་སོགས་པ་ཟག་པ་མེད་པའི་ཕུང་པོ་ལྔ་པོ་དག་ལའོ།། ​རང་བཞིན་གྱིས་སྟོང་པར་རྣམ་པར་ལྟའོ་ནི་ཟག་པ་དང་བཅས་པའི་ཕུང་པོ་རྣམས་འདོར་བར་འདོད་པ་དང་། ཟག་པ་མེད་པའི་ཕུང་པོ་རྣམས་བླང་བར་འདོད་པ་རྣམས་ལ་རང་བཞིན་མ་གྲུབ་པར་བསྟན་པའི་ཕྱིར་རོ།། ",
            "དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ནི་དུས་གསུམ་གྱི་སངས་རྒྱས་ཀྱི་དགོངས་པ་ཟབ་མོས་ཁམས་གསུམ་གྱི་སེམས་ཅན་གྱི་དྲན་པའི་སྣང་བ་ལ་བྱིན་གྱིས་བརླབས་པས་སྤོབས་པ་མཐའ་ཡས་པ་སྐྱེས་སོ།། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་ནི་དུས་གསུམ་གྱི་སངས་རྒྱས་ཀྱི་དགོངས་པ་ཟབ་མོ་འབའ་ཞིག་ལ་མོས་པའི་གང་ཟག་རྣམས་ཀྱི་དོན་ལ་དགོངས་ནས་དྲི་བར་བྱའོ་སྙམ་དུ་བསམ་པ་སྐྱེས་པའོ།། ​དེ་ལ་དགོངས་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ།། ",
            "རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ནི་ཐེག་པ་ཆེན་པོ་པའི་རིགས་ཅན་རྣམས་སོ།། ​​དེའི་ནང་ནས་ཟབ་མོའི་དོན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་མོས་ཤིང་དོན་དུ་གཉེར་བ་རྣམས་སོ།། ​དེ་ཡང་སེམས་ཉིད་གཅིག་པ་ལ་རྨི་ལམ་ལྟར་ཐ་དད་དུ་སྣང་བ་ནི་སྐྱེས་པ་དང་བུད་མེད་དོ།། ​གང་ལ་ལ་ནི་ཟབ་མོའི་དོན་ལ་མ་མོས་ཤིང་འཇིགས་པ་དང་སྡང་བ་དང་སྐྲག་པར་འགྱུར་བ་ཡང་ཡོད་དོ།། ​ལ་ལས་ནི་ཟབ་མོའི་ཆོས་ཐོས་པ་ཙམ་གྱིས་དགའ་ཞིང་མགུ་ལ་སེམས་བསྐྱེད་པ་ཙམ་གྱིས་བླ་ན་མེད་པའི་བྱང་ཆུབ་ཐོབ་པ་ཡང་ཡོད་དོ།། ​​ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་སྤྱོད་པ་སྤྱད་པར་འདོད་པ་དེས་ནི་བདག་དང་གཞན་མི་དམིགས་པའི་ཚུལ་གྱིས་ཇི་ལྟར་བསླབ་པར་བྱ་ཞེས་དྲིས་སོ།། ",
            "​​དེ་སྐད་ཅེས་སྨྲས་པ་དང་ནི་དྲིས་པའི་ལན་གདབ་པར་བྱའོ་ཞེས་དགོངས་པའི་ཐ་ཚིག་གོ །​གང་གིས་དགོངས་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་ཟབ་མོའི་ཆོས་ལ་ཇི་ལྟ་བ་བཞིན་དུ་དགོངས་ནས་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།། ",
            "​ཤཱ་རིའི་བུ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ནི་ཟབ་མོ་དོན་དུ་གཉེར་བ་རྣམས་ཀྱི་དེད་དཔོན་དུ་གྱུར་པ་ཤཱ་རིའི་བུ་ལ་དམིགས་ནས་མདོ་གཞན་པ་རྣམས་ནི་སྙིང་པོ་མེད་པ་སྤུན་པའི་རྣམ་པ་ལྟ་བུ་སྟེ། གང་ལ་ལ་ནི་དྲང་བའི་དོན་གྱི་མདོ་ལ་མོས་པ་དང་། ལ་ལ་ནི་ངེས་པའི་དོན་གྱི་མདོ་ལ་མོས་པ་རྣམས་སོ།། ​ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་དུས་གསུམ་གྱི་སངས་རྒྱས་ཀྱི་ཐུགས་ཀྱི་སྙིང་པོ་ཡིན་པ་དང་། དེ་བས་ཀྱང་ཟབ་མོའི་དོན་བློའི་སྤྱོད་ཡུལ་མ་ཡིན་པས། ཟབ་མོ་སྤྱད་པ་སྤྱོད་པར་འདོད་པ་དེས་འདི་ལྟར་རྣམ་པར་བལྟ་བར་བྱ་སྟེ་ནི་དོན་ཟབ་མོའི་ཆོས་ཉིད་ལ་བློས་སྤྱད་པར་དཀའ་བས་སོ།། ​སྣང་བའི་ཆོས་ལ་སྤྱད་པས་ནི་སྙིང་པོའི་ཆོས་དང་མི་ཕྲད་དོ།། ",
            "དེ་བས་ན་དྲན་པའི་སྣང་བ་འདི་རྣམས་རྣམ་པར་མ་བྱང་གི་བར་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྙིང་པོའི་དོན་རྟོགས་པར་དཀའ་བས་ཕུང་པོ་ལྔ་པོ་དེ་དག་ཀྱང་རང་བཞིན་གྱིས་སྟོང་པར་ཡང་དག་པར་རྗེས་སུ་བལྟའོ།། ",
            "​འོ་ན་ཕྱིན་ཅི་མ་ལོག་པར་ཟབ་མོའི་ཆོས་ཉིད་དང་མ་ཕྲད་པའི་ཕྱི་རོལ་པ་ནི་བདག་ཏུ་ལྟ་བ་དང་། བདག་མེད་པར་ལྟ་བ་རྣམས་སོ།། ​དེ་ཡང་བདག་ཏུ་ལྟ་བ་ནི་རིག་པ་ཡང་དག་པར་ཡོད་པར་ཁས་ལེན་པ་རྣམས་སོ།། ​བདག་མེད་པ་ལ་མོས་པ་ནི་རིག་པ་སྟོང་པ་གཉིས་སུ་མེད་པར་སྨྲ་བ་རྣམས་སོ།། དེ་ཡང་གང་ཟག་དང་ཆོས་ལ་བདག་མེད་པར་ལྟ་བ་ལ་བློ་གོམས་པར་བྱ་བའི་དོན་དུ་ཕྱི་དང་ནང་ཐམས་ཅད་ལ་རྡུལ་ཕྲ་རབ་ཏུ་གཞིག་ཅིང་བལྟས་པས་བདག་མ་རྙེད་པ་ལ་བློ་གོམས་པར་བྱས་ནས་མཉམ་པ་ཉིད་ལ་གཞག་པའི་དུས་སུ་ཅི་ཡང་མི་དམིགས་ཅི་ཡང་མི་རྟོག་པ་དེ་ལ་ཡུན་རིང་དུ་སེམས་གནས་པ་ཐོབ་པར་བྱ་བའི་ཡུལ་དུ་བྱས་པ་ན་སེམས་དངས་ཤིང་ཉམས་དགའ་བ་ལ་དམིགས་པ་ནི་མཉམ་པར་གཞག་པའོ།།  ​རྗེས་ལ་ཐོབ་པའི་དུས་སུ་ཆོས་ཐམས་ཅད་སྒྱུ་མ་ལྟ་བུ་དང་། རྨི་ལམ་ལྟ་བུ་དང་། སྨིག་རྒྱུ་ལྟ་བུ་དང་། སྒྲ་བརྙན་ལྟ་བུ་དང་། ཆུ་ཟླ་ལྟ་བུ་དང་། འཇའ་ཚོན་ལྟ་བུ་དང་། དྲི་ཟའི་གྲོང་ཁྱེར་ལྟ་བུ་དང་། མགལ་མེ་བསྐོར་བ་ལྟ་བུ་དང་། སྐྲ་ཤད་འཛིངས་པ་ལྟ་བུ་དང་། དབང་པོའི་དྲ་བ་ལྟ་བུ་དང་། སྤྲུལ་པའི་རྣམ་པ་ལ་དམིགས་ནས་ཡིད་བྱུང་ཞིང་སྣ་ཚོགས་སྟོང་པ་ཉིད་དང་ཟུང་དུ་འཇུག་པ་ལ་མོས་པའི་གང་ཟག་རྣམས་ཀྱི་དོན་དུ་གཟུགས་སྟོང་པའོ།། ",
            "སྟོང་པ་ཉིད་གཟུགས་སོ།། ",
            "གཟུགས་ལས་ཀྱང་སྟོང་པ་ཉིད་གཞན་མ་ཡིན་ནོ།། ",
            "སྟོང་པ་ཉིད་ལས་ཀྱང་གཟུགས་གཞན་མ་ཡིན་ནོ་ཞེས་གསུངས་སོ།། ",
            "​གཟུགས་ཀྱི་ཕུང་པོ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། ​རྣམ་པར་ཤེས་པ་རྣམས་སྟོང་པའོ།། ​རྣམས་ཞེས་བྱ་བས་ནི་རྣམ་པར་ཤེས་པའི་ཚོགས་བརྒྱད་ཀྱང་སྟོང་པ་ཉིད་དོ།། ​དེའི་ནང་ནས་ཀུན་གཞི་རྣམ་པར་ཤེས་པ་ཟབ་ཅིང་ཕྲ་བ་དེ་དོན་དུ་གཉེར་བ་ཡོད་དེ་དེ་ནི་ལེགས་པ་མ་ཡིན་ནོ།། ​འདིས་ཅི་བསྟན་ཞེ་ན། སྣང་བ་སྣ་ཚོགས་དྲན་པས་ཡུལ་དུ་བྱས་པའི་སྒྱུ་མ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་དབང་པོའི་མངོན་སུམ་གྱིས་གཏན་ལ་ཕབ་པའི་ཆོས་ཐམས་ཅད་ཟུང་དུ་འཇུག་པའི་དྲན་པ་ལ་བརྟེན་པ་སོ་སོའི་སྐྱེ་བོའི་ཆོས་བསྟན་ཟིན་ཏོ།། ​",
            "ད་ནི་ཟབ་མོའི་ཆོས་ཉིད་ལ་བརྟེན་པ་སོ་སོའི་སྐྱེ་བོའི་སྤྱོད་ཡུལ་མ་ཡིན་པ་དྲན་པ་མེད་པ་དང་། སྐྱེ་བ་མེད་པ་དང་། བློའི་སྤྱོད་ཡུལ་ལས་འདས་པ་དེ་ནི་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་གསུམ་པོ་ནི་ཡིད་ཀྱི་མངོན་སུམ་དང་། རང་རིག་པའི་མངོན་སུམ་དང་། རྣལ་འབྱོར་གྱི་མངོན་སུམ་གྱིས་སྟོང་པ་ཉིད་རབ་ཏུ་མི་གནས་པ་དང་། བཏང་སྙོམས་རབ་ཏུ་མི་གནས་པ་དང་། རྒྱུན་ཆད་རབ་ཏུ་མི་གནས་པ་དང་གསུམ་གྱིས་རྐྱེན་གསུམ་དང་བྲལ་བའི་ཤེས་རབ་རྣམ་གསུམ་གྱི་གདམས་ངག་ནི།ཤཱ་རིའི་བུ་དེ་ལྟ་བས་ན་ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་དེའོ།། ​དེ་ལ་ནི་གཟུགས་མེད། ཚོར་བ་མེད་པ་ནས་རྒ་ཤི་ཟད་པའི་བར་དུ་ཡང་མེད་དོ་ཞེས་པའི་བར་གྱིས་སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་སྤྲུལ་པའི་སྐུ་བསྟན་ནོ།། ​"
          ]
        ]
      }
    ]
  }
}
