{
  "source": {
    "categories": [
      {
        "name": "The Buddha's Teachings",
        "enDesc": "",
        "enShortDesc": "Kangyur and newly translated teachings of the Buddha"
      },
      {
        "name": "Prajnaparamita",
        "enDesc": "",
        "enShortDesc": ""
      },
      {
        "name": "Diamond Cutter Sutra test",
        "enDesc": "",
        "enShortDesc": ""
      },
      {
        "name": "Diamond Cutter Sutra test level 2",
        "enDesc": "",
        "enShortDesc": ""
      },
      {
        "name": "金刚经，又称金刚般若波罗蜜经 Combined Commentary 2",
        "enDesc": "",
        "enShortDesc": ""
      }
    ],
    "books": [
      {
        "title": "金刚经，又称金刚般若波罗蜜经 Combined Commentary",
        "language": "zh",
        "versionSource": "claude",
        "direction": "ltr",
        "completestatus": "done",
        "content": [
          [
            "《金刚经》藏文题名注释<br><br>## 原文分析<br>**༄༅། །འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྡོ་རྗེ་གཅོད་པ་ཞེས་བྱ་བ་བཞུགས་སོ། །**<br><br>## 详细注释<br><br>这是著名的大乘佛教经典《金刚般若波罗蜜多经》（梵文：Vajracchedikā Prajñāpāramitā Sūtra）的藏文题名。让我们逐字进行分析：<br><br>### ༄༅།<br>这是藏文典籍开头常用的装饰性符号，表示文本的开始，具有吉祥如意的含义。在藏传佛教传统中，经文的每一个部分，包括标点符号，都被视为神圣的。<br><br>### འཕགས་པ་（phags pa）<br>意为'圣'或'尊贵的'。在佛教语境中，指超越世俗、已证悟的教法。此词强调本经的崇高地位和权威性，表明它不是普通教义，而是佛陀殊胜智慧的流露。<br><br>### ཤེས་རབ་（shes rab）<br>对应梵文'般若'（prajñā），意为'智慧'。这不是世间的知识或理解，而是对实相、空性的直接洞见。在大乘佛教中，般若是六波罗蜜之一，是通往解脱的关键要素。<br><br>### ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་（kyi pha rol tu phyin pa）<br>对应梵文'波罗蜜多'（pāramitā），字面意思是'到达彼岸'，指修行的完善与圆满。象征着从无明的此岸到解脱的彼岸的精神旅程。<br><br>### རྡོ་རྗེ་（rdo rje）<br>对应梵文'金刚'（vajra），意为'金刚石'或'金刚杵'。金刚象征不可摧毁的坚固和能摧毁一切的力量。在密教中，金刚杵是重要的仪式法器，代表坚不可摧的菩提心和智慧。<br><br>### གཅོད་པ་（gcod pa）<br>意为'切断'或'断除'。与'金刚'结合，表示本经具有切断或粉碎一切执着、妄想和概念分别的力量。<br><br>### ཞེས་བྱ་བ་（zhes bya ba）<br>意为'称为'或'名为'，连接经名与'收录'之意。<br><br>### བཞུགས་སོ། （bzhugs so）<br>意为'在此收录'或'此处安住'，表示经文从此处开始。<br><br>## 哲学意义<br><br>《金刚经》是般若部经典中的精髓，其核心教义是阐述'空性'（śūnyatā）。这部经典以其精准而又矛盾修辞的方式，系统地解构了我们对实体存在的执着。经中著名的教导如'所谓佛法，即非佛法，是名佛法'的逻辑形式，旨在引导修行者超越二元对立的概念思维。<br><br>在藏传佛教中，《金刚经》被视为是理解中观哲学（Mādhyamika）的基础文本。宗喀巴大师等藏传佛教先哲都对本经有详尽的注释，将其作为解脱道的重要指南。<br><br>## 修行意义<br><br>从修行的角度来看，'金刚般若'是一种能够切断一切执着的智慧，特别是对'我'和'法'两种执着的断除。这种智慧如同金刚一样坚固不摧，能够粉碎一切无明和妄想。<br><br>在藏传佛教传统中，《金刚经》不仅是学术研究的对象，也是日常修持的核心经典。许多修行人通过持诵、思维和观修《金刚经》来培养对空性的证悟。<br><br>## 不同诠释传统<br><br>在藏传佛教中，不同的宗派对《金刚经》有着各自的解读传统：<br>- 格鲁派强调通过严密的逻辑分析来理解空性<br>- 宁玛派则更注重将《金刚经》的教义与大圆满的直指心性相结合<br>- 噶举派则将其与大手印的修持方法相融合<br><br>总之，这个简单的藏文题名包含了整部《金刚经》的精髓和目的：通过金刚般的智慧断除一切执着，证悟空性，最终达到解脱的彼岸。",
            "《金刚般若波罗蜜多经》梵文题解<br><br>## 梵文题目解析<br><br>梵文原题'ཨརྱཱ་བཛྲ་ཙྪེད་ཀ་པྲཛྙཱ་པ་ར་མི་ཏཱ་ནཱ་མ་མ་ ཱ་ཡ་ན་སཱུ་ཏྲ'（Āryavajracchedakaprajñāpāramitānāmamahāyānasūtra）可分解如下：<br><br>- **Ārya**（ཨརྱཱ）：意为'圣'，表示此经乃圣者所说或具圣者品质<br>- **Vajra**（བཛྲ）：意为'金刚'，象征坚固、锐利、不可摧毁的性质<br>- **Cchedaka**（ཙྪེད་ཀ）：意为'能断'或'切断'，表示彻底摧毁<br>- **Prajñā**（པྲཛྙཱ）：意为'般若'或'智慧'，指通达实相的殊胜智慧<br>- **Pāramitā**（པ་ར་མི་ཏཱ）：意为'到彼岸'或'度'，指圆满完成<br>- **Nāma**（ནཱ་མ）：意为'名为'，连接词<br>- **Mahā**（མ་ཧཱ）：意为'大'<br>- **Yāna**（ཡ་ན）：意为'乘'，指修行的道路和方法<br>- **Sūtra**（སཱུ་ཏྲ）：意为'经'，佛陀的教诲<br><br>## 语法构成解析<br><br>'波罗蜜多'（Pāramitā）一词的构成特别值得注意：它由'pāra'（彼岸）和'ita'（去）两部分组成，中间加入第二格助词'as'，然后经过音变，'i'被省略，'ma'和'i'连接后变成'mi'，最终形成'pāramitā'，意为'到达彼岸'。<br><br>## 经名含义<br><br>此经名的深层含义可从'金刚能断'的比喻理解：正如帝释天手中的金刚杵（vajra）坚固无比，不被任何外物所摧毁，反而能摧毁一切坚硬物质；同样，此经所宣说的般若波罗蜜多智慧也具有无比坚固的本质，不被任何邪见所动摇，而能彻底断除一切烦恼障和所知障，摧毁我执和法执的根本。<br><br>金刚杵象征着不可摧毁的智慧，而'能断'则表示此智慧能够切断无明束缚。般若智慧如同金刚宝石，既坚固又锐利，能够切断一切虚妄分别，通达诸法的本来面目。经由此殊胜智慧，行者能够从此岸的生死轮回到达彼岸的涅槃解脱，成就无上菩提。<br><br>总之，《金刚般若波罗蜜多经》指的是能够如金刚一般摧毁一切执著，帮助行者圆满般若智慧，抵达觉悟彼岸的大乘经典。",
            "《圣般若波罗蜜多金刚经》经题详解<br><br>## 藏文经题'བོད་སྐད་དུ། འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྡོ་རྗེ་གཅོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།'的七义广释<br><br>经题意为'藏语中：圣般若波罗蜜多金刚截断所说大乘经'。此经题包含七种义处，因其为般若波罗蜜多之所依故，称为义处。<br><br>### 一、称号解释<br><br>梵文本经题各词解析：<br>- 'Ārya'：意为'圣'，表明此经所诠之法超越世间。<br>- 'Vajra'：意为'金刚'，表示坚固不可摧毁。<br>- 'Chedaka'：意为'截断'，表示断除之功能。<br>- 'Prajñā'：意为'智慧'，指能辨别诸法实相之智。<br>- 'Pāramitā'：由'Pāra'（彼岸）和'Ita'（到达）构成，中间加入第二语格助词'As'，经语法变化而成，意为'度到彼岸'。<br>- 'Nāma'：意为'所谓'或'名为'。<br>- 'Mahāyāna'：由'Mahā'（大）和'Yāna'（乘）组成，意为'大乘'。<br>- 'Sūtra'：意为'经'，佛陀金口所宣之教法。<br><br>### 二、名称含义<br><br>'金刚能断'之名称与二义相关：<br>1. **金刚比喻**：如同帝释天手中金刚杵不能被外物摧毁，且能将山岩击为尘埃，此经所诠之般若波罗蜜多亦不为违缘所动，且能从根本截断一切烦恼。<br><br>2. **微细与精华**：般若波罗蜜多因其性质微细而难以了知，因本质精华而难以断除，唯有通过闻思修般若波罗蜜多才能断除执著。<br><br>### 三、形象表征<br><br>金刚应被描绘为两端广大而中间收缩之形。由此般若波罗蜜多之表征：<br>- 中间收缩：表示清净增上意乐地<br>- 前后宽广：前表示胜解行地，后表示如来相应地<br><br>此形象显示了修行者的发展轨迹，从初始胜解行地，经中间修道位，最终达到佛地。<br><br>### 四、典籍传承<br><br>此般若波罗蜜多乃从佛陀法脉不断绝而开始，关乎佛陀教法如何不间断地流传。经中云：'由正入菩萨乘'，即长老须菩提如理请问，超胜三种菩提（声闻、缘觉、佛菩提）。<br><br>### 五、断除功能<br><br>般若波罗蜜多即通达空性的智慧，具有全面切断之形相，能够：<br>- 摧毁邪见与烦恼<br>- 从根本断除一切执著<br>- 不被违缘所动摇<br>- 引导修行者抵达解脱彼岸<br><br>通过对般若波罗蜜多的闻思修，能如金刚般切断一切妄想执著，体证诸法实相。<br><br>### 六、大乘法门<br><br>本经为大乘经典，直指成佛之道，超越小乘境界，以广大菩提心为根本，以深广智慧为引导，以利他为目标，故名'大乘'。<br><br>### 七、究竟旨趣<br><br>本经最终指向通达空性智慧，证悟无我，断除烦恼根本，成就无上菩提。般若为佛母，能生诸佛，故为三世诸佛之所依。",
            "综合注解<br><br>## 「སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །」<br><br>### 敬礼一切佛菩萨<br><br>此句为藏传佛教经论的传统开篇，表达对诸佛菩萨的至诚顶礼。此敬礼句具有多重意义：<br><br>首先，从形式上看，印度及藏传佛教传统中，著作者在撰写任何教法论典之前必先顶礼三宝，以表虔诚并祈求加持，使著作圆满无碍。此为'造论五要'之首要条件，即敬礼、立宗、发愿、论义正文及回向。<br><br>其次，敬礼对象为'一切佛菩萨'而非仅敬礼佛陀，这表明本论所阐述的教法与大乘佛教密切相关。特别是在《般若波罗蜜多》等经论中，菩萨的重要性与佛陀并提，因为大乘道路强调发菩提心、行菩萨行，最终圆满佛果。<br><br>从教义上解析，此敬礼句包含以下深层含义：<br><br>1. **对圆满果位的礼敬**：敬礼诸佛，表示对已成就圆满菩提者的崇敬，彰显了修行的终极目标。<br><br>2. **对道位行者的礼敬**：敬礼诸菩萨，表示对正在修行道上精进者的尊重，展示了修行的过程。<br><br>3. **三业恭敬**：顶礼不仅是语言表述，更意味着以身礼拜、以语称颂、以意至诚归依，是全身心的投入。<br><br>4. **内在意义**：从究竟义而言，此敬礼也是对自心本具佛性的认可。《宝性论》云：'礼敬自心佛，无上诸众生。'<br><br>5. **加持相续**：此敬礼也表明作者立于佛菩萨加持相续中，如注释所言：'此般若波罗蜜多亦是从佛种相续不断而开始的'，表明此论所阐述的智慧源自佛陀的教法相续。<br><br>在《般若波罗蜜多能断金刚》的语境中，这一敬礼尤为重要，因为般若智慧正是通过诸佛菩萨的加持而得以传承。如注释所述，'能断金刚'之名与两种义理相关：一是能摧毁邪见与烦恼，二是因其性质细微精要而如金刚般坚固。通过对诸佛菩萨的敬礼，行者得以进入般若波罗蜜多的修持，从听闻、思维到修习，最终断除一切障碍。<br><br>总之，这简短而庄严的敬礼句不仅是形式上的礼节，更是整个论著精神内核的浓缩，指明了修行的源头、过程与目标，为后文的义理阐释奠定了坚实基础。",
            "《'འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།'注释》<br><br>'འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།'（如是我闻，一时）<br><br>此句是佛经的传统开篇语，具有重要的教法意义。在梵文原典中，这句话被作为经典真实性的标志，表明此经是由佛陀直接宣说，且由亲近者（通常是阿难尊者）亲耳所闻而后结集。<br><br>'如是我闻'四字，虽在授记等多种义理上也可见，但在此处应理解为'安立'之义，即安立了以下所述一切经文的内容。这一开场白是依照佛陀的嘱咐而设立的，目的是消除对经典真实性的怀疑。<br><br>'如是'表示所闻之法的确定性，确立了以下所述内容为真实不虚的佛陀教言。此语亦显示了法的如实性，即诸法的真如实相。<br><br>'我'字用来排除他人，表明是亲自所闻而非转述。这里的'我'指的是结集者（通常为阿难尊者），他亲自从佛陀处听闻此法。这也表明了佛法的传承必须有可靠的来源。<br><br>'闻'字用来否定自悟，因为除佛陀外，无人能自悟如此甚深法义，由此能消除对经典来源的怀疑。'闻'还表明了佛法是通过听闻而得以传承的，强调了佛法传承的耳传心授方式。<br><br>'一时'指在某一特定时刻，表明如此殊胜正法难以常闻，应当珍惜。或者表明结集者多闻博学，意为'一时闻此，他时闻彼'。又或将'一时'与下文连接，意为'一时，世尊住于某处'，这是为利益无量所化众生，安立佛陀的不同住处和教化情境。<br><br>在般若波罗蜜多的传统中，此开篇语尤为重要，因为般若法门如同金刚能断除一切邪见与烦恼。般若波罗蜜多因其微细且精要而成为金刚，微细是因为难以理解，精要是因为难以断除，唯有通过闻思修才能真正通达。<br><br>此开篇语作为序分的一部分，既确立了法脉的传承，也为接下来的正文内容奠定了基础，使听闻者对法义生起殊胜信心。",
            "《世尊住舍卫城经文注释》<br><br>བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན། <br>(世尊住在舍卫城祇树给孤独园)<br><br>'世尊'（བཅོམ་ལྡན་འདས་）是佛陀的尊称，此称号具有丰富的含义。从词源学角度解释，世尊是指已摧毁（བཅོམ）四魔（烦恼魔、蕴魔、死魔及天子魔），并具足（ལྡན）六种功德：权力、色相、吉祥、名声、智慧及精进，超越（འདས་）世间而获得如是称号。<br><br>'舍卫城'（མཉན་ཡོད་）是因为此地曾是舍卫仙人的居住地而得名。经中特别提及此地，是为了明确说法地点，使经文具有可信度，也表明此地已成为圣地。舍卫城作为一个广大的城市，需要进一步明确世尊的确切住处，因此提及'祇树给孤独园'。<br><br>'祇树'（རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་）是因这片园林属于祇陀太子而得名。'给孤独园'（མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་）则是因给孤独长者（又称须达多）而得名，此长者因常施食物给孤苦无依者而得此名。他为建造精舍而用黄金铺地购买园林，而祇陀太子则捐献了园中树木并装饰殿堂，故此园以两人名义闻名。<br><br>从深层意义上看，'舍卫城'表明佛陀住于众多人中，成就利他圆满；'祇树给孤独园'则表示住于寂静处，成就自利圆满。'住'（བཞུགས་）不仅表示身体姿态的四威仪（行、住、坐、卧），更代表无上的梵住、天住及圣住等殊胜心境。<br><br>དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང༌། <br>(与大比丘僧众一千二百五十位比丘)<br><br>'比丘'（དགེ་སློང་）是指已远离烦恼的修行者。'僧团'（དགེ་འདུན་）表示这些比丘团结一致，不为魔等对手所分裂。'大比丘僧团'（དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་）具有两个特点：一是数量众多，二是力量强大。此处'大'主要表示其力量强大。<br><br>特别提及'一千二百五十'（སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་）位比丘，明确说明当时随佛修行的确切人数。这些比丘因已作所作（完成了自己的修行义务），并出于悲悯心而恒常侍奉如来，故在经文中首先提及他们。<br><br>བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རབ་ཏུ་མང་པོ་དག་དང་ཐབས་གཅིག་ཏུ་བཞུགས་སོ། །<br>(与众多菩萨摩诃萨共住)<br><br>除了比丘僧团外，还有'众多菩萨摩诃萨'（བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རབ་ཏུ་མང་པོ་）在场，这表明此经不仅是为声闻弟子宣说，也是为修大乘道的菩萨们而说。<br><br>'菩萨'（བྱང་ཆུབ་སེམས་དཔའ་）是因具有向菩提迈进的勇猛心而得名。由于声闻也有向菩提之心，为了区别，特称为'摩诃萨'（སེམས་དཔའ་ཆེན་པོ་），即具七种大特质者：<br><br>1. 法大：因为对菩萨宣说《十万颂般若》等广大法门<br>2. 发心大：因为发无上正等正觉之心<br>3. 信解大：因为信解甚深广大之法<br>4. 意乐大：因为具足利益安乐一切众生之意乐<br>5. 资粮大：因为积集无量福德智慧资粮<br>6. 时大：因为经过三大阿僧祇劫而证菩提<br>7. 圆满大：因为证得无上正等正觉<br><br>菩萨因有无量众生的事业未完成，且大悲心切，为成办众生利益而游历诸世界，不常住佛所，故在经文中后提及。'共住'（ཐབས་གཅིག་ཏུ་བཞུགས་）表示当时这些菩萨摩诃萨与佛陀、比丘僧团共同在场。<br><br>此段经文作为整部经典的缘起部分，确立了经典的时间、地点、主角及听众，为后续的教法奠定基础，也使经文具有可信性和权威性。",
            "经文注疏<br><br>## 总体解析<br>《དེ་ནས་བཅོམ་ལྡན་འདས་སྔ་དྲོའི་དུས་ཀྱི་ཚེ། ཤམ་ཐབས་དང་ཆོས་གོས་སྐུ་ལ་གསོལ་ཏེ། ལྷུང་བཟེད་བསྣམས་ནས་མཉན་ཡོད་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་བསོད་སྙོམས་ཀྱི་ཕྱིར་གཤེགས་སོ། །》<br><br>## 逐句详解<br><br>**དེ་ནས 然后**  <br>此词表示时间顺序，指在前面所述事件之后。这也是佛经常见的叙述方式，表明法会或教法的延续性。<br><br>**བཅོམ་ལྡན་འདས 世尊**  <br>'བཅོམ་ལྡན་འདས'意为'征服者、具德者、超越者'，是佛陀的尊称。此处指释迦牟尼佛，他已征服四魔（蕴魔、烦恼魔、死魔和天子魔），具足一切功德，超越三界轮回。<br><br>**སྔ་དྲོའི་དུས་ཀྱི་ཚེ 清晨时分**  <br>'སྔ་དྲོའི'指早晨，'དུས་ཀྱི་ཚེ'表示确定的时间。此处不仅仅指一般的早晨，而是特指比丘和八关斋戒者可以接受饮食的适当时间。佛陀选择这个时间托钵乞食，是为了教导弟子遵守戒律。经文特别强调'时'，因为世尊可能在其他时间也有所行动，但这里特别指出是在适合托钵的'时'。<br><br>**ཤམ་ཐབས་དང་ཆོས་གོས་སྐུ་ལ་གསོལ་ཏེ། 穿上下裙与法衣**  <br>'ཤམ་ཐབས'指下裙，是比丘基本服装，覆盖下身。'ཆོས་གོས'指法衣，即僧袍。'སྐུ་ལ་གསོལ'表示穿在身上，特别是'披着'的方式。世尊穿着这样的服装是为了使声闻弟子尊敬学处（戒律），示范正确的修行人形象。这也体现了佛陀的教导原则：先自调伏，方能调伏他人。<br><br>**ལྷུང་བཟེད་བསྣམས་ནས 手持钵盂**  <br>'ལྷུང་བཟེད'指托钵用的钵盂，'བསྣམས'表示手持、携带。钵盂是比丘必备的法器之一，用于接受信众供养的食物。佛陀亲自持钵是为了教导弟子知足少欲的修行态度。<br><br>**མཉན་ཡོད་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར 前往舍卫大城**  <br>'མཉན་ཡོད'即舍卫国，古印度的重要国家之一。'གྲོང་ཁྱེར་ཆེན་པོ'指大城市，用以区别于整个舍卫国。这表明佛陀特意选择人口稠密的地区托钵，以便度化更多众生。<br><br>**བསོད་སྙོམས་ཀྱི་ཕྱིར་གཤེགས་སོ། 为托钵乞食而前行**  <br>'བསོད་སྙོམས'指托钵乞食的行为，'ཕྱིར་གཤེགས'表示为了这一目的而前行。<br><br>## 深层含义<br><br>佛陀托钵乞食有多重深意：<br><br>1. **示范修行生活**：教导声闻弟子知足少欲，依靠乞食维生而不执著于物质条件。<br><br>2. **平等利益众生**：通过托钵接触各阶层人士，包括家庭主妇、贫穷者、病人、老人等，给予他们种植福田的机会。<br><br>3. **展现神通**：如《圣法集经》所言：'如来无遮蔽，无饥渴，不大小便，身体不衰弱。'实际上，佛陀不需要食物维持生命，但示现进食是为了随顺众生心意，示现人身精进可获无上地位。<br><br>4. **加持众生**：当佛陀甘露般的指甲触及食物时，食物变成最美味的天界滋味，且取之不竭，能使饿鬼等众生得到满足和解脱。<br><br>5. **净化施主**：通过展示对施主托钵的清净行为，使施主生起欢喜心，种下解脱种子。<br><br>6. **头陀行示范**：佛陀亲自托钵是为了引导声闻弟子修持头陀功德。<br><br>综上所述，佛陀看似简单的托钵行为实则蕴含无量意义，既是为调伏弟子示范正确的修行方式，也是为度化众生而示现的方便法门。",
            "《金刚经》经文注释<br><br>## 经文<br>དེ་ནས་བཅོམ་ལྡན་འདས་མཉན་ཡོད་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་བསོད་སྙོམས་ཀྱི་ཕྱིར་གཤེགས་ནས་ཞལ་ཟས་གསོལ་ཏེ་ཟས་ཀྱི་བྱ་བ་མཛད་དེ།<br><br>## 综合注释<br><br>此经文描述了世尊于舍卫城（मञन्यद्）大城市中托钵乞食并进食的情景。'大城市'特指舍卫城，是当时的重要都市，也是佛陀常驻说法之地。<br><br>世尊为何前往托钵乞食？有多重深意：一是为引导声闻弟子修习少欲知足之德；二是为利益城中在家妇女、贫穷者、病人、老人等各类众生；三是通过托钵行为使盲人等获得见闻佛陀的机会；四是借由种种不同神变令他人对世尊生起深厚信心。此外，托钵也是佛陀示现人身精进即能获得无上菩提的方便教法。<br><br>'饮食事已'指世尊完成了进食的行为。关于佛陀进食的问题，经典中有'如来无饥渴，不大小便，身体无乏力'的记载。实际上，连梵天等由微小善根所生的存在，尚且已离食欲不需进食，何况世尊从无量不可思议善根而生？然而，世尊以化身示现饮食行为是为随顺所化众生之意乐，使众生亲近佛法。<br><br>佛陀进食有诸多不可思议的功德：<br>1. 展示正确受用信众供养的方式，令施主生起欢喜；<br>2. 对于那些虽有福报但因业障生于饿鬼等处的众生，世尊甘露指甲的接触能使食物成为最上天味且无尽，令饿鬼等众生得以满足；<br>3. 通过饮食行为展示头陀功德，引导弟子们正确修行。<br><br>世尊进食后，安置钵与法衣。虽然帝释天等常勤于世尊前听受教法，但为显示出家人应自行处理日常事务，世尊亲自整理钵与衣物，也为安慰那些福报微小无侍者的修行人。<br><br>在完成饮食事后，世尊'正身端坐'，即不过于前俯后仰而安住于威仪中。世尊说法前以静坐威仪而住，是为了教导世间人应精进于静修，表明唯有通过静修才能真正理解、教导和听闻此甚深法义。<br><br>'正念安住'表示世尊忆念昔日作为菩萨时所发的'获得无上果位后，当如何使佛种不断'的大愿。虽然诸佛世尊常住等持中，但此时特别显现忆念是为了宣说能令三宝种性相续不断的甚深般若波罗蜜多法门。"
          ]
        ]
      }
    ]
  },
  "target": {
    "categories": [
      {
        "name": "སངས་རྒྱས་ཀྱི་བཀའ།",
        "heDesc": "",
        "heShortDesc": "བཀའ་འགྱུར་དང་དེང་དུས་གསར་དུ་བསྒྱུར་བའི་བཀའ།"
      },
      {
        "name": "ཤེར་ཕྱིན།",
        "heDesc": "",
        "heShortDesc": ""
      },
      {
        "name": "རྡོ་རྗེ་གཅོད་པ། test",
        "heDesc": "",
        "heShortDesc": ""
      },
      {
        "name": "རྡོ་རྗེ་གཅོད་པ། test level 2",
        "heDesc": "",
        "heShortDesc": ""
      },
      {
        "name": "རྡོ་རྗེ་གཅོད་པའི་རྒྱ་ཡིག་འགྲེལ་པ་ཕྱོགས་བསྡུས། test 2",
        "heDesc": "",
        "heShortDesc": ""
      }
    ],
    "books": [
      {
        "title": "རྡོ་རྗེ་གཅོད་པའི་རྒྱ་ཡིག་འགྲེལ་པ་ཕྱོགས་བསྡུས། test",
        "language": "bo",
        "versionSource": "claude",
        "direction": "ltr",
        "completestatus": "done",
        "content": []
      }
    ]
  }
}
